# üîß COMMANDES CISCO IOS - FICHE ESSENTIELLE
## Routeurs et Switchs - Commandes de base pour l'examen

> **Pour l'examen** : Connais les commandes de configuration de base, VLAN, routage statique, SSH, et sauvegarde !

---

## üìã TABLE DES MATI√àRES

1. [Modes d'utilisation](#modes)
2. [Commandes de base](#base)
3. [Configuration initiale](#config)
4. [Interface et IP](#interface)
5. [VLAN (Switch)](#vlan)
6. [Routage statique](#routage)
7. [SSH et Telnet](#ssh)
8. [Sauvegarde et restauration](#sauvegarde)
9. [Diagnostic r√©seau](#diagnostic)
10. [Commandes TOP 20 pour l'examen](#top20)

---

## üéØ MODES D'UTILISATION <a id="modes"></a>

### 1. Mode Utilisateur (User EXEC)
```
Router>
```
- **Acc√®s** : Par d√©faut √† la connexion
- **Droits** : Consultation uniquement
- **Commandes** : `show`, `ping`, `traceroute`

### 2. Mode Privil√©gi√© (Privileged EXEC)
```
Router#
```
- **Acc√®s** : `Router> enable`
- **Droits** : Toutes les commandes show + commandes de debug
- **Commandes** : Tous les `show`, `debug`, `copy`, `reload`

### 3. Mode Configuration Globale
```
Router(config)#
```
- **Acc√®s** : `Router# configure terminal` (ou `conf t`)
- **Droits** : Configuration du routeur/switch
- **Commandes** : Hostname, mots de passe, interfaces, routage

### 4. Mode Configuration d'Interface
```
Router(config-if)#
```
- **Acc√®s** : `Router(config)# interface FastEthernet0/0`
- **Droits** : Configuration d'une interface sp√©cifique

### 5. Mode Configuration de Ligne
```
Router(config-line)#
```
- **Acc√®s** : `Router(config)# line vty 0 4`
- **Droits** : Configuration des lignes de connexion (console, VTY)

---

## üîπ COMMANDES DE BASE <a id="base"></a>

### Navigation entre modes

| Commande | Action |
|----------|--------|
| `enable` | User ‚Üí Privileged |
| `configure terminal` (ou `conf t`) | Privileged ‚Üí Config globale |
| `interface <nom>` | Config globale ‚Üí Config interface |
| `line console 0` / `line vty 0 4` | Config globale ‚Üí Config ligne |
| `exit` | Retour au mode pr√©c√©dent |
| `end` | Retour direct au mode Privileged |
| `disable` | Privileged ‚Üí User |

### Aide et compl√©tion

| Commande | Action |
|----------|--------|
| `?` | Liste des commandes disponibles |
| `sh?` | Commandes commen√ßant par "sh" |
| `show ?` | Options de la commande show |
| `Tab` | Auto-compl√©tion |
| `Ctrl+C` | Interruption de commande |
| `Ctrl+Z` | Retour au mode Privileged |

---

## ‚öôÔ∏è CONFIGURATION INITIALE <a id="config"></a>

### Nom du routeur/switch
```
Router> enable
Router# configure terminal
Router(config)# hostname R1
R1(config)#
```

### Mot de passe ENABLE (mode privil√©gi√©)
```
R1(config)# enable secret Cisco123!
```
> ‚ö†Ô∏è `enable secret` est **chiffr√©** (MD5), pr√©f√©rable √† `enable password`

### Mot de passe Console
```
R1(config)# line console 0
R1(config-line)# password Console123
R1(config-line)# login
R1(config-line)# exit
```

### Mot de passe VTY (Telnet/SSH)
```
R1(config)# line vty 0 4
R1(config-line)# password VTY123
R1(config-line)# login
R1(config-line)# transport input ssh telnet
R1(config-line)# exit
```

### Banni√®re de connexion
```
R1(config)# banner motd #
Acc√®s r√©serv√© au personnel autoris√© !
#
```

### Chiffrement des mots de passe
```
R1(config)# service password-encryption
```
> Chiffre tous les mots de passe en clair (type 7 - faible)

---

## üåê CONFIGURATION INTERFACE ET IP <a id="interface"></a>

### Configurer une IP sur une interface

**Routeur** :
```
R1(config)# interface GigabitEthernet0/0
R1(config-if)# ip address 192.168.1.1 255.255.255.0
R1(config-if)# description LAN-ADMIN
R1(config-if)# no shutdown
R1(config-if)# exit
```

**Switch (VLAN 1 par d√©faut)** :
```
SW1(config)# interface vlan 1
SW1(config-if)# ip address 192.168.1.10 255.255.255.0
SW1(config-if)# no shutdown
SW1(config-if)# exit
```

### Passerelle par d√©faut (Switch uniquement)
```
SW1(config)# ip default-gateway 192.168.1.1
```

### V√©rifier la configuration
```
R1# show ip interface brief
R1# show interfaces GigabitEthernet0/0
R1# show ip route
```

---

## üîÄ VLAN (SWITCH UNIQUEMENT) <a id="vlan"></a>

### Cr√©er un VLAN
```
SW1(config)# vlan 10
SW1(config-vlan)# name ADMIN
SW1(config-vlan)# exit

SW1(config)# vlan 20
SW1(config-vlan)# name USERS
SW1(config-vlan)# exit
```

### Assigner un port √† un VLAN (mode Access)
```
SW1(config)# interface FastEthernet0/5
SW1(config-if)# switchport mode access
SW1(config-if)# switchport access vlan 10
SW1(config-if)# exit
```

### Configurer un port Trunk (inter-switch ou switch-routeur)
```
SW1(config)# interface GigabitEthernet0/1
SW1(config-if)# switchport mode trunk
SW1(config-if)# switchport trunk allowed vlan 10,20,30
SW1(config-if)# exit
```

### V√©rifier les VLAN
```
SW1# show vlan brief
SW1# show interfaces trunk
SW1# show interfaces FastEthernet0/5 switchport
```

### Supprimer un VLAN
```
SW1(config)# no vlan 10
```

---

## üõ§Ô∏è ROUTAGE STATIQUE <a id="routage"></a>

### Route statique classique
```
R1(config)# ip route <r√©seau_destination> <masque> <next_hop_ou_interface>
```

**Exemple 1** : Via next-hop
```
R1(config)# ip route 192.168.2.0 255.255.255.0 10.0.0.2
```
> Route vers 192.168.2.0/24 via le routeur 10.0.0.2

**Exemple 2** : Via interface de sortie
```
R1(config)# ip route 192.168.3.0 255.255.255.0 GigabitEthernet0/1
```

### Route par d√©faut (default route)
```
R1(config)# ip route 0.0.0.0 0.0.0.0 <next_hop>
```

**Exemple** :
```
R1(config)# ip route 0.0.0.0 0.0.0.0 200.100.50.1
```
> Toutes les destinations inconnues ‚Üí 200.100.50.1

### V√©rifier les routes
```
R1# show ip route
R1# show ip route static
```

### Supprimer une route
```
R1(config)# no ip route 192.168.2.0 255.255.255.0 10.0.0.2
```

---

## üîê SSH ET TELNET <a id="ssh"></a>

### Configuration SSH (VERSION 2 RECOMMAND√âE)

**√âtape 1** : Nom d'h√¥te et domaine
```
R1(config)# hostname R1
R1(config)# ip domain-name entreprise.local
```

**√âtape 2** : G√©n√©rer les cl√©s RSA
```
R1(config)# crypto key generate rsa
How many bits in the modulus [512]: 1024
```
> ‚ö†Ô∏è Minimum 768 bits pour SSHv2, **1024 bits recommand√©**

**√âtape 3** : Cr√©er un utilisateur local
```
R1(config)# username admin privilege 15 secret AdminPass123!
```

**√âtape 4** : Configurer les lignes VTY
```
R1(config)# line vty 0 4
R1(config-line)# transport input ssh
R1(config-line)# login local
R1(config-line)# exit
```

**√âtape 5** : Forcer SSH version 2
```
R1(config)# ip ssh version 2
R1(config)# ip ssh time-out 60
R1(config)# ip ssh authentication-retries 3
```

### V√©rifier SSH
```
R1# show ip ssh
R1# show ssh
```

### Se connecter en SSH (depuis un autre √©quipement)
```
R1# ssh -l admin 192.168.1.1
```

---

## üíæ SAUVEGARDE ET RESTAURATION <a id="sauvegarde"></a>

### Voir les configurations

| Commande | Description |
|----------|-------------|
| `show running-config` | Config active (RAM) |
| `show startup-config` | Config de d√©marrage (NVRAM) |

### Sauvegarder la configuration

**M√©thode 1** : Commande classique
```
R1# copy running-config startup-config
Destination filename [startup-config]? [Entr√©e]
```

**M√©thode 2** : Commande courte
```
R1# write memory
```
ou
```
R1# wr
```

### Restaurer la configuration de d√©marrage
```
R1# copy startup-config running-config
```

### Effacer la configuration
```
R1# erase startup-config
R1# reload
```
> ‚ö†Ô∏è **reload** red√©marre l'√©quipement

### Sauvegarder vers un serveur TFTP
```
R1# copy running-config tftp:
Address or name of remote host []? 192.168.1.100
Destination filename [r1-confg]? backup-r1.cfg
```

### Restaurer depuis un serveur TFTP
```
R1# copy tftp: running-config
Address or name of remote host []? 192.168.1.100
Source filename []? backup-r1.cfg
```

---

## ü©∫ DIAGNOSTIC R√âSEAU <a id="diagnostic"></a>

### Commandes de v√©rification

| Commande | Usage |
|----------|-------|
| `show version` | Version IOS, uptime, m√©moire |
| `show running-config` | Configuration active |
| `show startup-config` | Configuration sauvegard√©e |
| `show ip interface brief` | **ESSENTIEL** - √âtat des interfaces |
| `show interfaces` | D√©tails de toutes les interfaces |
| `show ip route` | **ESSENTIEL** - Table de routage |
| `show vlan brief` | Liste des VLAN (switch) |
| `show mac address-table` | Table MAC (switch) |
| `show arp` | Table ARP |
| `show ip protocols` | Protocoles de routage actifs |
| `show clock` | Date et heure |
| `show flash` | Contenu de la m√©moire Flash |

### Tests de connectivit√©

**Ping** :
```
R1# ping 192.168.1.10
R1# ping 192.168.1.10 repeat 100
R1# ping 192.168.1.10 size 1500
```

**Traceroute** :
```
R1# traceroute 8.8.8.8
```

**Telnet** (test de port) :
```
R1# telnet 192.168.1.10 80
```

### Debug (avec pr√©caution !)
```
R1# debug ip icmp
R1# debug ip routing
R1# no debug all  ‚Üê TOUJOURS arr√™ter le debug !
```
> ‚ö†Ô∏è Le debug peut saturer le CPU en production

---

## ‚≠ê TOP 20 COMMANDES POUR L'EXAMEN <a id="top20"></a>

| # | Commande | Usage |
|---|----------|-------|
| 1 | `enable` | Passer en mode privil√©gi√© |
| 2 | `configure terminal` | Entrer en mode config |
| 3 | `hostname <nom>` | Changer le nom |
| 4 | `enable secret <mdp>` | Mot de passe enable chiffr√© |
| 5 | `interface <nom>` | Configurer une interface |
| 6 | `ip address <IP> <masque>` | Assigner une IP |
| 7 | `no shutdown` | Activer une interface |
| 8 | `ip route <r√©seau> <masque> <next_hop>` | Route statique |
| 9 | `show ip interface brief` | **√âtat des interfaces** |
| 10 | `show ip route` | **Table de routage** |
| 11 | `show running-config` | Config active |
| 12 | `copy running-config startup-config` | **Sauvegarder** |
| 13 | `vlan <num√©ro>` | Cr√©er un VLAN |
| 14 | `switchport mode access` | Port en mode access |
| 15 | `switchport access vlan <n>` | Assigner VLAN |
| 16 | `switchport mode trunk` | Port en mode trunk |
| 17 | `line vty 0 4` | Config lignes SSH/Telnet |
| 18 | `transport input ssh` | Autoriser SSH |
| 19 | `ping <IP>` | Test connectivit√© |
| 20 | `reload` | Red√©marrer |

---

## üìå SC√âNARIOS D'EXAMEN FR√âQUENTS

### Sc√©nario 1 : Configuration initiale routeur

```
Router> enable
Router# configure terminal
Router(config)# hostname R1
R1(config)# enable secret Cisco123!
R1(config)# line console 0
R1(config-line)# password Console123
R1(config-line)# login
R1(config-line)# exit
R1(config)# interface GigabitEthernet0/0
R1(config-if)# ip address 192.168.1.1 255.255.255.0
R1(config-if)# no shutdown
R1(config-if)# exit
R1(config)# exit
R1# copy running-config startup-config
```

### Sc√©nario 2 : Configuration VLAN sur switch

```
SW1# configure terminal
SW1(config)# vlan 10
SW1(config-vlan)# name ADMIN
SW1(config-vlan)# exit
SW1(config)# vlan 20
SW1(config-vlan)# name USERS
SW1(config-vlan)# exit
SW1(config)# interface FastEthernet0/5
SW1(config-if)# switchport mode access
SW1(config-if)# switchport access vlan 10
SW1(config-if)# exit
SW1(config)# interface GigabitEthernet0/1
SW1(config-if)# switchport mode trunk
SW1(config-if)# exit
SW1# write memory
```

### Sc√©nario 3 : Configuration SSH

```
R1(config)# hostname R1
R1(config)# ip domain-name lab.local
R1(config)# crypto key generate rsa
[1024]
R1(config)# username admin privilege 15 secret Admin123!
R1(config)# line vty 0 4
R1(config-line)# transport input ssh
R1(config-line)# login local
R1(config-line)# exit
R1(config)# ip ssh version 2
```

### Sc√©nario 4 : Routage statique

```
R1(config)# ip route 192.168.2.0 255.255.255.0 10.0.0.2
R1(config)# ip route 192.168.3.0 255.255.255.0 10.0.0.2
R1(config)# ip route 0.0.0.0 0.0.0.0 200.50.100.1
R1(config)# exit
R1# show ip route
```

---

## üí° ASTUCES POUR L'EXAMEN

### ‚úÖ √Ä RETENIR ABSOLUMENT

1. **no shutdown** apr√®s config d'interface (sinon reste down)
2. **copy run start** pour sauvegarder (sinon perdu au reboot)
3. **enable secret** est chiffr√©, **enable password** non
4. **SSH n√©cessite** : hostname + domain-name + crypto key + user local
5. **Mode trunk** = plusieurs VLANs, **mode access** = un seul VLAN
6. **ip default-gateway** sur switch, **ip route 0.0.0.0 0.0.0.0** sur routeur

### üî• ERREURS FR√âQUENTES

‚ùå Oublier `no shutdown` ‚Üí interface reste down  
‚ùå Oublier `copy run start` ‚Üí config perdue au reboot  
‚ùå Confondre `transport input ssh` et `transport input telnet`  
‚ùå Oublier `login` ou `login local` sur line vty ‚Üí connexion refus√©e  
‚ùå Mauvais masque de sous-r√©seau  
‚ùå Route statique sans next-hop  

---

## üéØ CHECKLIST AVANT L'EXAMEN

- [ ] Je connais les 5 modes (User, Privileged, Config, Interface, Line)
- [ ] Je sais configurer une IP sur une interface
- [ ] Je sais cr√©er des VLAN et les assigner aux ports
- [ ] Je sais configurer un port trunk
- [ ] Je sais configurer une route statique
- [ ] Je sais configurer SSH (hostname, domain, crypto, user, vty)
- [ ] Je sais sauvegarder la config (`copy run start`)
- [ ] Je connais les commandes `show ip interface brief` et `show ip route`
- [ ] Je sais faire un ping et un traceroute
- [ ] Je sais distinguer mode access et mode trunk

---

**üöÄ Tu es pr√™t pour les commandes Cisco IOS ! Passe au QCM R√©seau maintenant !**
